<h1>Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#데이터-관리-프로그램-만들기" data-toc-modified-id="데이터-관리-프로그램-만들기-1">데이터 관리 프로그램 만들기</a></span><ul class="toc-item"><li><span><a href="#전체-코드" data-toc-modified-id="전체-코드-1.1">전체 코드</a></span></li></ul></li><li><span><a href="#Pandas로-테이블-데이터-다루기" data-toc-modified-id="Pandas로-테이블-데이터-다루기-2">Pandas로 테이블 데이터 다루기</a></span><ul class="toc-item"><li><span><a href="#데이터-합치기:-merge,-join,-concat" data-toc-modified-id="데이터-합치기:-merge,-join,-concat-2.1">데이터 합치기: merge, join, concat</a></span><ul class="toc-item"><li><span><a href="#pd.merge()" data-toc-modified-id="pd.merge()-2.1.1">pd.merge()</a></span></li><li><span><a href="#df.join()" data-toc-modified-id="df.join()-2.1.2">df.join()</a></span></li><li><span><a href="#df.concat()" data-toc-modified-id="df.concat()-2.1.3">df.concat()</a></span></li></ul></li><li><span><a href="#필터링-연산" data-toc-modified-id="필터링-연산-2.2">필터링 연산</a></span><ul class="toc-item"><li><span><a href="#df['컬럼명']" data-toc-modified-id="df['컬럼명']-2.2.1">df['컬럼명']</a></span></li><li><span><a href="#loc()" data-toc-modified-id="loc()-2.2.2">loc()</a></span></li><li><span><a href="#iloc()" data-toc-modified-id="iloc()-2.2.3">iloc()</a></span></li></ul></li><li><span><a href="#그룹연산:-groupby(),-apply()" data-toc-modified-id="그룹연산:-groupby(),-apply()-2.3">그룹연산: groupby(), apply()</a></span></li><li><span><a href="#Pandas-실전-연습" data-toc-modified-id="Pandas-실전-연습-2.4">Pandas 실전 연습</a></span></li></ul></li><li><span><a href="#파이썬으로-데이터베이스-다루기" data-toc-modified-id="파이썬으로-데이터베이스-다루기-3">파이썬으로 데이터베이스 다루기</a></span><ul class="toc-item"><li><span><a href="#파이썬-DB-API" data-toc-modified-id="파이썬-DB-API-3.1">파이썬 DB-API</a></span></li><li><span><a href="#DB-API-실전연습" data-toc-modified-id="DB-API-실전연습-3.2">DB-API 실전연습</a></span></li></ul></li></ul></div>

# 데이터 관리 프로그램 만들기
사원들의 정보가 담긴 파일을 읽어 들여 월급을 계산하고, 월급이 가장 높은 사원을 찾는 프로그램을 만들어봅시다.

In [1]:
# Employee Class 설계
class Employee:
    def __init__ (self, name, division, jobgrade, years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)
# 텍스트 파일에서 불러온 각각의 데이터는 string으로 처리됩니다. 따라서 형 변환을 해주세요.

In [2]:
# 사원 1명 데이터를 추가해봅니다.
employee1 = Employee('Ahn TaeHee', 'AI Team', '3', '3', '300')

In [3]:
# 파일을 한 줄씩 읽은 뒤 자동으로 인스턴스 객체를 만들어 주는 함수
def make_employee(inputdata):
    name, division, jopgrade, year, basic = inputdata.split(',')
    return Employee(name, division, jopgrade, year, basic)

In [4]:
# 파일을 열어서 반복문으로 모든 라인을 순회
import os
file_path = os.getenv("HOME") + '/aiffel/data_handling/data/employeefile.txt'
print(file_path)
inputfile = open(file_path, 'r')

for i in inputfile:
    e = make_employee(i)

/home/ssac21/aiffel/data_handling/data/employeefile.txt

In [5]:
# 정보 접근자 메소드
# 보통은 메소드로 구현해 값을 반환받는 것이 일반적 (Clean Code)
class Employee:
    def get_name(self):
        return self.name
    def get_division(self):
        return self.division
    def get_jobgrade(self):
        return self.jobgrade
    def get_years(self):
        return self.years
    def get_basic(self):
        return self.basic

In [6]:
# 급여 계산 (기본 급여 + 기본 급여의 10% * 근속연수)
def get_salary(self):
    self.salary = self.basic + (self.basic * self.years * 0.1)
    return self.salary

In [7]:
# 완성된 Employee 클래스
class Employee:
    def __init__ (self, name, division, jobgrade, years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)
        self.salary = 0

    def get_name(self):
        return self.name

    def get_divison(self):
        return self.division
    
    def get_jobgrade(self):
        return self.jobgrade
    
    def get_years(self):
        return self.years
    
    def get_basic(self):
        return self.basic

    def get_salary(self):
        self.salary = self.basic + (self.basic * self.years * 0.1)
        return self.salary

## 전체 코드
파일을 열고 각 사원의 월급을 비교해서 가장 높은 월급을 가진 사원의 정보를 출력합니다.

In [8]:
import os

class Employee:
    def __init__ (self, name, division, jobgrade, years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)
        self.salary = 0

    def get_name(self):
        return self.name

    def get_division(self):
        return self.division
    
    def get_jobgrade(self):
        return self.jobgrade
    
    def get_years(self):
        return self.years
    
    def get_basic(self):
        return self.basic

    def get_salary(self):
        self.salary = self.basic + (self.basic * self.years * 0.1)
        return self.salary

def make_employee(inputdata):
    name, division, jopgrade, year, basic = inputdata.split(',')
    return Employee(name, division, jopgrade, year, basic)

def summarize():
    file_path = os.getenv("HOME") + '/aiffel/data_handling/data/employeefile.txt'
    inputfile = open(file_path, 'r')
    highest = make_employee(inputfile.readline())
    for l in inputfile:
        e = make_employee(l)
        if e.get_salary() > highest.get_salary():
            highest = e
    inputfile.close()
    
    print("The name of the highest salary employee is: ", highest.get_name())
    print("Years of service: ", highest.get_years())
    print("Division: ", highest.get_division())
    print("Salay: ", highest.get_salary())

In [9]:
summarize()

The name of the highest salary employee is:  Kim YoungJae
Years of service:  7
Division:   Sales
Salay:  1020.0

# Pandas로 테이블 데이터 다루기

## 데이터 합치기: merge, join, concat

### pd.merge()
merge() 메소드는 공통의 칼럼에 있는 값을 키로 사용해 데이터를 합쳐줍니다. merge() 에는 on 인자에 키 값을 넣어 주어 공통 칼럼이 여러 개인 경우를 대비해 직접 값을 넣어줄 수 있으며, 키 값이 될 수 있는 필드가 1개더라도 명확한 코드를 작성하기 위해 키 값을 담은 컬럼(column)의 이름을 직접 나타내주면 좋습니다.

In [10]:
import pandas as pd

df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Math': [100, 55, 38, 43, 68, 82]})

print(df1)
print('---')
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
---
       Student  Math
0    KimTaemin   100
1     HaJaehwa    55
2  JungSayoung    38
3     Sonjimin    43
4    Leesoomin    68
5      KangJun    82

In [11]:
pd.merge(df1, df2)

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3     Sonjimin      35       44    43
4    Leesoomin      40       55    68
5      KangJun      44       90    82

In [12]:
pd.merge(df1, df2, on='Student')

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3     Sonjimin      35       44    43
4    Leesoomin      40       55    68
5      KangJun      44       90    82

**pd.merge(how='inner')**   
공통의 데이터에 대해서만 데이터를 합치는 것을 inner join 이라고 합니다. merge()의 how 매개변수 기본값은 "inner"으로, 아무것도 지정해 주지 않으면 inner join으로 연산됩니다.

In [13]:
df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['Jiyoungmin','KimTaemin'],
                    'Math':[44,33]})

print(df1)
print('---')
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
---
      Student  Math
0  Jiyoungmin    44
1   KimTaemin    33

In [14]:
pd.merge(df1, df2, how='inner')

     Student  Korean  English  Math
0  KimTaemin      90       80    33

In [15]:
pd.merge(df1, df2)

     Student  Korean  English  Math
0  KimTaemin      90       80    33

**pd.merge(how='outer')**   
outer join은 전체 데이터에 합치는 연산을 합니다.

In [16]:
pd.merge(df1, df2, how='outer')

       Student  Korean  English  Math
0    KimTaemin    90.0     80.0  33.0
1     HaJaehwa    85.0     90.0   NaN
2  JungSayoung    88.0     40.0   NaN
3     Sonjimin    35.0     44.0   NaN
4    Leesoomin    40.0     55.0   NaN
5      KangJun    44.0     90.0   NaN
6   Jiyoungmin     NaN      NaN  44.0

### df.join()
merge() 대신 DataFrame 클래스의 메소드인 join()을 이용할 수도 있습니다.

In [17]:
df1.join(df2, how='outer', lsuffix='_caller', rsuffix='_other')   # '_caller'인 df1 컬럼이 왼쪽에 가도록 배치

  Student_caller  Korean  English Student_other  Math
0      KimTaemin      90       80    Jiyoungmin  44.0
1       HaJaehwa      85       90     KimTaemin  33.0
2    JungSayoung      88       40           NaN   NaN
3       Sonjimin      35       44           NaN   NaN
4      Leesoomin      40       55           NaN   NaN
5        KangJun      44       90           NaN   NaN

### df.concat()
데이터를 합치는 또 다른 방법으로 이어 붙이기(적층, 연결)가 있습니다. 데이터의 칼럼을 늘리는 것이 아니라 데이터의 행을 합치는 것입니다.

In [18]:
df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['Jiyoungmin','LeeJae','KimJaehee'],
                    'Korean': [44,73,100]})

print(df1)
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
      Student  Korean
0  Jiyoungmin      44
1      LeeJae      73
2   KimJaehee     100

In [19]:
pd.concat([df1,df2], sort=False)

       Student  Korean  English
0    KimTaemin      90     80.0
1     HaJaehwa      85     90.0
2  JungSayoung      88     40.0
3     Sonjimin      35     44.0
4    Leesoomin      40     55.0
5      KangJun      44     90.0
0   Jiyoungmin      44      NaN
1       LeeJae      73      NaN
2    KimJaehee     100      NaN

In [20]:
pd.concat([df1, df2], sort=False, ignore_index=True)

       Student  Korean  English
0    KimTaemin      90     80.0
1     HaJaehwa      85     90.0
2  JungSayoung      88     40.0
3     Sonjimin      35     44.0
4    Leesoomin      40     55.0
5      KangJun      44     90.0
6   Jiyoungmin      44      NaN
7       LeeJae      73      NaN
8    KimJaehee     100      NaN

## 필터링 연산

In [21]:
df = pd.DataFrame({"A": [1,4,7], "B": [2,5,8], "C":[3,6,9]})

df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

### df['컬럼명']

In [22]:
df['A']

0    1
1    4
2    7
Name: A, dtype: int64

### loc()

In [23]:
print(df.loc[0])

A    1
B    2
C    3
Name: 0, dtype: int64

In [24]:
print(df.loc[0, 'B'])

2

In [25]:
print(df.loc[:, 'A'])

0    1
1    4
2    7
Name: A, dtype: int64

### iloc()

In [26]:
print(df.iloc[0])

A    1
B    2
C    3
Name: 0, dtype: int64

In [27]:
print(df.iloc[:, 0])

0    1
1    4
2    7
Name: A, dtype: int64

In [28]:
print(df.iloc[0, 1])

2

## 그룹연산: groupby(), apply()
- groupby()객체를 생성
- groupby()객체의 연산을 수행
    - max(), min(), sum(), mean()
    - apply() 메소드를 통해 특수 수식에 대한 연산을 수행할 수 있습니다.

In [29]:
df = pd.DataFrame({'Columns1':['A','A','B','B','C','C','A','B'],
                   'Columns2':[10, 2, 30, -6, 8, 9, 5, 2]})

df

  Columns1  Columns2
0        A        10
1        A         2
2        B        30
3        B        -6
4        C         8
5        C         9
6        A         5
7        B         2

In [30]:
import numpy as  np
df.groupby(['Columns1']).max().apply(np.sqrt)

          Columns2
Columns1
A         3.162278
B         5.477226
C         3.000000

## Pandas 실전 연습

In [31]:
import pandas as pd
import numpy as np

file_path = os.getenv("HOME") + '/aiffel/data_handling/data/Salaries.csv'
sal = pd.read_csv(file_path)

sal.head(5)

/home/ssac21/anaconda3/envs/aiffel/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3147: DtypeWarning: Columns (12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [32]:
# Q1. 평균 basepay는 얼마인가요?
sal['BasePay'].mean()

66327.6889596918

In [33]:
# Q2. 최대 OvertimePay는 얼마인가요?
sal['OvertimePay'].max()

245131.88

In [34]:
# Q3. JOSEPH DRISCOLL의 job title은 무엇인가요?
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [35]:
# Q4. JOSEPH DRISCOLL의 급여는 얼마인가요? (benefits 포함해서)
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [36]:
# Q5. 월급(Benefit포함) 이 가장 높은 사람은 누구인가요?
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [37]:
# Q6. 월급(Benefit포함) 이 가장 낮은 사람은 누구인가요?
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
110530,110531,David P Kucia,Police Officer 3,NaN,0.0,0.0,-33.89,0.0,-33.89,2013,NaN,San Francisco,NaN

In [38]:
# Q7. 2011~2014년 동안의 연도별 BasePay의 평균은 각각 얼마인가요?
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66573.154204
Name: BasePay, dtype: float64

In [39]:
# Q8. Job Title의 종류는 몇 개인가요?
sal['JobTitle'].nunique()

2158

In [40]:
# Q9. Job Title중 가장 많은 상위 5개의 Job Title은 무엇인가요?
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [41]:
# Q10. Chief 란 단어를 갖는 Job Title은 몇 개인가요? 
# chief_string()이라는 함수를 만들고 lambda 문법을 사용해 함수를 적용해 보세요.

def chief_string(title):
    if 'chief' in title.lower().split(): 
        return True
    else:
        return False
sum(sal['JobTitle'].apply(lambda x : chief_string(x)))

477

# 파이썬으로 데이터베이스 다루기

## 파이썬 DB-API
파이썬은 DB-API 함수를 이용해서 DB와 연결하고 SQL문을 사용할 수 있게 합니다.
- connect(): 데이터베이스의 연결을 만든다.
- cursor(): 질의를 관리하기 위한 커서 객체를 만든다. (file의 open과 비슷)
- execute(), excutemany(): 데이터베이스에 하나 이상의 SQL명령을 실행한다.
- fetchone(), fetchmany(), fetchall(): 실행 결과를 얻는다.

In [42]:
# 연결: connect()
import sqlite3
conn = sqlite3.connect('example.db')

In [43]:
# 커서 객체 만들기: cursor()
c = conn.cursor()

In [44]:
# 쿼리 명령어 : execute(), executemany()
# Create table
c.execute('''CREATE TABLE stocks
             (date text, trans text, symbol text, qty real, price real)''')

# Insert a row of data
c.execute("INSERT INTO stocks VALUES ('2006-01-05','BUY','RHAT',100,35.14)")

In [45]:
# 데이터베이스에 반영: commit()
conn.commit()

In [46]:
# 종료: close()
conn.close()

## DB-API 실전연습

In [47]:
# 1단계. 메모리에 SQLite3 데이터베이스를 만들고 4가지 속성을 지닌 sales 테이블을 만든다.
import sqlite3

conn = sqlite3.connect(':memory:')
query = """CREATE TABLE sales
            (product VARCHAR(20),
            maker VARCHAR(40),
            amount FLOAT,
            date DATE);"""
conn.execute(query)
conn.commit()

In [48]:
# 2단계. sales 테이블에 데이터를 삽입한다.
data = [('smart phone', 'Apple', '47.2', '2019-08-03'),
        ('printer', 'Samsung', '15.2', '2018-02-10',),
        ('monitor', 'LG', '14.25', '2019-12-20'),
        ('python book', 'Amazon', '12.40', '2020-01-23')]
statement = "INSERT INTO sales VALUES(?, ?, ?, ?)"
conn.executemany(statement, data)
conn.commit()

In [49]:
# 3단계. sales 테이블에 질의한다.
cursor = conn.execute("SELECT * FROM sales")
rows = cursor.fetchall()

In [50]:
# 4단계. 출력 데이터의 개수를 샌다.
row_counter = 0
for row in rows:
    print(row)
    row_counter +=1

print("Number of rows: {}".format(row_counter))

('smart phone', 'Apple', 47.2, '2019-08-03')
('printer', 'Samsung', 15.2, '2018-02-10')
('monitor', 'LG', 14.25, '2019-12-20')
('python book', 'Amazon', 12.4, '2020-01-23')
Number of rows: 4

In [51]:
# 전체 코드
import sqlite3

conn = sqlite3.connect(':memory:')
query = """CREATE TABLE sales
            (product VARCHAR(20),
            maker VARCHAR(40),
            amount FLOAT,
            date DATE);"""
conn.execute(query)
conn.commit()

data = [('smart phone', 'Apple', '47.2', '2019-08-03'),
        ('printer', 'Samsung', '15.2', '2018-02-10',),
        ('monitor', 'LG', '14.25', '2019-12-20'),
        ('python book', 'Amazon', '12.40', '2020-01-23')]
statement = "INSERT INTO sales VALUES(?, ?, ?, ?)"
conn.executemany(statement, data)
conn.commit()

cursor = conn.execute("SELECT * FROM sales")
rows = cursor.fetchall()

row_counter = 0
for row in rows:
    print(row)
    row_counter +=1

print("Number of rows: {}".format(row_counter))

('smart phone', 'Apple', 47.2, '2019-08-03')
('printer', 'Samsung', 15.2, '2018-02-10')
('monitor', 'LG', 14.25, '2019-12-20')
('python book', 'Amazon', 12.4, '2020-01-23')
Number of rows: 4